accelerator-s/ai_assistant_stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 * @file  main.c
 * @brief 主程序入口 — 全异步、无阻塞主循环版本
 *
 * 系统状态:
 *   STATE_IDLE       — 待机状态，等待用户操作
 *   STATE_RECORDING  — 录音中（K1 按住）
 *   STATE_REC_PAUSED — 录音暂停（K1 松开，可继续录或发送）
 *   STATE_WAITING    — 等待 AI 回复
 *   STATE_HISTORY    — 历史记录列表浏览
 *
 * 设计原则:
 *   1. 主循环不使用任何阻塞式网络发送
 *   2. 音频上传仅通过异步 TCP 发送队列推进
 *   3. 麦克风探测改为非阻塞状态机，不再直接同步采样等待
 *   4. 所有控制命令均通过异步文本发送接口入队
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "bsp/bsp_key.h"
#include "lcd/display.h"
#include "wifi/esp8266.h"
#include "wifi/wifi_config.h"
#include "audio/i2s_mic.h"
#include "debug/debug_uart.h"
#include "lcd/lcd.h"
#include <string.h>
#include <stdio.h>
#include <stdlib.h>

/* ===================== 系统状态定义 ===================== */

typedef enum
{
    STATE_IDLE = 0,   /* 待机状态 */
    STATE_RECORDING,  /* 正在录音 */
    STATE_REC_PAUSED, /* 录音暂停，等待继续或发送 */
    STATE_WAITING,    /* 等待 AI 回复 */
    STATE_HISTORY     /* 历史记录浏览 */
} sys_state_t;

static sys_state_t sys_state = STATE_IDLE;

/* ===================== 按键事件 ===================== */

typedef enum
{
    KEY_EVENT_NONE = 0,
    KEY_EVENT_K1_PRESS,
    KEY_EVENT_K1_RELEASE,
    KEY_EVENT_K2_SHORT,
    KEY_EVENT_K2_LONG,
    KEY_EVENT_K2_DOUBLE
} key_event_t;

static uint32_t k2_press_tick = 0;
static uint8_t k2_press_count = 0;
static uint32_t k2_last_release_tick = 0;
static uint8_t k2_was_pressed = 0;

#define K2_LONG_PRESS_MS 800u
#define K2_DOUBLE_CLICK_MS 300u

/* ===================== 录音与上传缓冲 ===================== */

static uint32_t rec_start_tick = 0;
static uint8_t k1_no_tcp_hint_latched = 0;

#define AUDIO_UPLOAD_BUFFER_SAMPLES 16000u
#define AUDIO_UPLOAD_CHUNK_SAMPLES 1024u
#define AUDIO_UPLOAD_TRIGGER_SAMPLES AUDIO_UPLOAD_CHUNK_SAMPLES
#define AUDIO_UPLOAD_DOWNSAMPLE 4u
#define AUDIO_UPLOAD_GAIN_Q8 512

#define WIFI_COLOR_CONNECTED COLOR_ACCENT_GREEN
#define WIFI_COLOR_DISCONNECTED COLOR_ICON_MIC

static int16_t audio_upload_buffer[AUDIO_UPLOAD_BUFFER_SAMPLES];
static volatile uint16_t audio_upload_write_pos = 0;
static volatile uint16_t audio_upload_read_pos = 0;
static volatile uint8_t audio_upload_overflow = 0;
static volatile uint32_t audio_upload_dropped_samples = 0;
static int32_t audio_upload_downsample_acc = 0;
static uint16_t audio_upload_downsample_count = 0;
static volatile uint8_t rec_end_pending = 0;
static volatile uint8_t mic_rec_done_pending = 0;

/* ===================== 非阻塞麦克风探测 ===================== */

typedef enum
{
    MIC_PROBE_IDLE = 0,
    MIC_PROBE_RUNNING
} mic_probe_state_t;

typedef enum
{
    MIC_REC_TEST_IDLE = 0,
    MIC_REC_TEST_RUNNING
} mic_rec_test_state_t;

static mic_probe_state_t mic_probe_state = MIC_PROBE_IDLE;
static uint32_t mic_probe_start_tick = 0;
static volatile uint16_t mic_probe_nonzero_count = 0;
static volatile uint16_t mic_probe_sample_count = 0;
static volatile uint8_t mic_probe_collecting = 0;
static mic_rec_test_state_t mic_rec_test_state = MIC_REC_TEST_IDLE;
static uint32_t mic_rec_test_start_tick = 0;
static uint32_t mic_rec_test_duration_ms = 3000u;
static uint8_t speaker_test_ok_pending = 0u;
static uint8_t speaker_tone_done_pending = 0u;
static uint8_t speaker_sweep_done_pending = 0u;
static uint8_t speaker_volume_done_pending = 0u;

#define MIC_PROBE_TIMEOUT_MS 250u
#define MIC_PROBE_MIN_NONZERO_SAMPLES 8u
#define MIC_PROBE_MIN_TOTAL_SAMPLES 64u

static void audio_upload_poll(void);
static void try_send_rec_end(void);
static void try_send_speaker_test_ok(void);
static void try_send_speaker_tone_done(void);
static void try_send_speaker_sweep_done(void);
static void try_send_speaker_volume_done(void);
static void pump_speaker_test_response(uint32_t timeout_ms);

/* ===================== 工具函数 ===================== */

static uint16_t ring_distance(uint16_t from, uint16_t to, uint16_t size)
{
    if (to >= from)
        return (uint16_t)(to - from);
    return (uint16_t)(size - from + to);
}

static uint8_t tcp_ready_for_send(void)
{
    return (esp8266_get_status() == ESP8266_STATUS_TCP_CONNECTED) ? 1u : 0u;
}

static void audio_buffer_reset(void)
{
    __disable_irq();
    audio_upload_read_pos = 0;
    audio_upload_write_pos = 0;
    audio_upload_overflow = 0;
    audio_upload_dropped_samples = 0;
    audio_upload_downsample_acc = 0;
    audio_upload_downsample_count = 0;
    __enable_irq();
}

static uint16_t audio_buffer_available(void)
{
    uint16_t read_pos, write_pos;
    __disable_irq();
    read_pos = audio_upload_read_pos;
    write_pos = audio_upload_write_pos;
    __enable_irq();
    return ring_distance(read_pos, write_pos, AUDIO_UPLOAD_BUFFER_SAMPLES);
}

static int16_t audio_upload_apply_gain(int16_t sample)
{
    int32_t amplified = ((int32_t)sample * (int32_t)AUDIO_UPLOAD_GAIN_Q8) >> 8;

    if (amplified > 32767)
        return 32767;
    if (amplified < -32768)
        return -32768;

    return (int16_t)amplified;
}

static void mic_probe_reset_stats(void)
{
    __disable_irq();
    mic_probe_nonzero_count = 0;
    mic_probe_sample_count = 0;
    __enable_irq();
}

static void mic_probe_start(void)
{
    if (mic_probe_state != MIC_PROBE_IDLE)
        return;

    mic_probe_reset_stats();
    mic_probe_collecting = 1;
    mic_probe_start_tick = HAL_GetTick();
    mic_probe_state = MIC_PROBE_RUNNING;

    if (!i2s_mic_is_recording())
    {
        i2s_mic_start();
    }

    display_show_system_hint("硬件检测中...");
    display_update_bottom_hint("正在检测麦克风连接...");
}

static void mic_probe_finish(uint8_t success)
{
    mic_probe_collecting = 0;
    if (i2s_mic_is_recording() && sys_state != STATE_RECORDING)
    {
        i2s_mic_stop();
    }

    mic_probe_state = MIC_PROBE_IDLE;

    if (success)
    {
        (void)esp8266_tcp_send_line_async("MIC_OK");
        display_show_system_hint("麦克风硬件检测通过");
    }
    else
    {
        (void)esp8266_tcp_send_line_async("MIC_FAIL");
        display_show_system_hint("麦克风硬件检测失败");
    }

    if (sys_state == STATE_IDLE)
    {
        display_update_bottom_hint("K1:录音 K2:发送/新建");
    }
}

