accelerator-s/ai_assistant_stm32/Core/Src/main.c
static void mic_probe_poll(void)
{
    uint16_t nonzero_count, sample_count;

    if (mic_probe_state != MIC_PROBE_RUNNING)
        return;

    __disable_irq();
    nonzero_count = mic_probe_nonzero_count;
    sample_count = mic_probe_sample_count;
    __enable_irq();

    if (nonzero_count >= MIC_PROBE_MIN_NONZERO_SAMPLES &&
        sample_count >= MIC_PROBE_MIN_TOTAL_SAMPLES)
    {
        mic_probe_finish(1u);
        return;
    }

    if ((HAL_GetTick() - mic_probe_start_tick) >= MIC_PROBE_TIMEOUT_MS)
    {
        mic_probe_finish(0u);
    }
}

static void mic_rec_test_start(uint32_t duration_sec)
{
    if (mic_rec_test_state != MIC_REC_TEST_IDLE)
        return;

    if (duration_sec < 1u)
        duration_sec = 1u;
    if (duration_sec > 10u)
        duration_sec = 10u;

    mic_rec_test_duration_ms = duration_sec * 1000u;
    mic_rec_test_start_tick = HAL_GetTick();
    mic_rec_test_state = MIC_REC_TEST_RUNNING;
    rec_end_pending = 0u;
    mic_rec_done_pending = 0u;
    audio_buffer_reset();

    (void)esp8266_tcp_send_line_async("REC_START");

    if (!i2s_mic_is_recording())
    {
        i2s_mic_start();
    }

    display_show_system_hint("录音测试中...");
    display_update_bottom_hint("请稍候，正在采集测试音频...");
}

static void mic_rec_test_finish(void)
{
    if (mic_rec_test_state != MIC_REC_TEST_RUNNING)
        return;

    if (i2s_mic_is_recording() && sys_state != STATE_RECORDING)
    {
        i2s_mic_stop();
    }

    mic_rec_test_state = MIC_REC_TEST_IDLE;
    /* 不在此处阻塞发送，由主循环的 audio_upload_poll() 排干缓冲，
     * 排干后 try_send_mic_rec_done() 自动发送 MIC_REC_DONE:sr=8000 */
    mic_rec_done_pending = 1u;
    display_show_system_hint("录音测试完成，上传中...");

    if (sys_state == STATE_IDLE)
    {
        display_update_bottom_hint("数据上传中...");
    }
}

static void mic_rec_test_poll(void)
{
    if (mic_rec_test_state != MIC_REC_TEST_RUNNING)
        return;

    if ((HAL_GetTick() - mic_rec_test_start_tick) >= mic_rec_test_duration_ms)
    {
        mic_rec_test_finish();
    }
}

/* ===================== TCP 下行消息处理 ===================== */

static void handle_tcp_downlink(void)
{
    char line[160];
    uint8_t loop_guard = 6;

    while (loop_guard-- > 0 && esp8266_tcp_read_line(line, sizeof(line)))
    {
        if (strncmp(line, "STT:", 4) == 0)
        {
            display_add_message(MSG_ROLE_USER, line + 4);
            if (sys_state == STATE_WAITING)
            {
                display_update_bottom_hint("识别完成，思考中...");
            }
        }
        else if (strncmp(line, "AI:", 3) == 0)
        {
            display_add_message(MSG_ROLE_ASSISTANT, line + 3);
            sys_state = STATE_IDLE;
            display_update_bottom_hint("K1:录音 K2:发送/新建");
        }
        else if (strncmp(line, "SYS:", 4) == 0)
        {
            display_show_system_hint(line + 4);
        }
        else if (strncmp(line, "TITLE:", 6) == 0)
        {
            display_update_title(line + 6);
        }
        else if (strcmp(line, "MIC_TEST") == 0)
        {
            mic_probe_start();
        }
        else if (strcmp(line, "SPK_TEST") == 0)
        {
            speaker_test_ok_pending = 1u;
            display_show_system_hint("SPK_TEST");
            try_send_speaker_test_ok();
        }
        else if (strncmp(line, "SPK_TONE:", 9) == 0)
        {
            uint16_t freq_hz = 1000u;
            uint16_t duration_ms = 1000u;
            char *duration_part = strchr(line + 9, ':');

            freq_hz = (uint16_t)atoi(line + 9);
            if (duration_part)
            {
                duration_ms = (uint16_t)atoi(duration_part + 1);
            }

            display_show_system_hint("SPK_TONE");
            speaker_tone_done_pending = 1u;
            pump_speaker_test_response(1200u);
            (void)i2s_mic_play_tone(freq_hz, duration_ms);
        }
        else if (strncmp(line, "SPK_SWEEP:", 10) == 0)
        {
            uint16_t start_hz = 300u;
            uint16_t end_hz = 3000u;
            uint16_t duration_ms = 2000u;
            char *end_part = strchr(line + 10, ':');
            char *duration_part = end_part ? strchr(end_part + 1, ':') : NULL;

            start_hz = (uint16_t)atoi(line + 10);
            if (end_part)
            {
                end_hz = (uint16_t)atoi(end_part + 1);
            }
            if (duration_part)
            {
                duration_ms = (uint16_t)atoi(duration_part + 1);
            }

            display_show_system_hint("SPK_SWEEP");
            speaker_sweep_done_pending = 1u;
            pump_speaker_test_response(1200u);
            (void)i2s_mic_play_sweep(start_hz, end_hz, duration_ms);
        }
        else if (strncmp(line, "SPK_VOLUME:", 11) == 0)
        {
            uint8_t levels[8] = {30u, 60u, 90u};
            uint8_t count = 0u;
            char *p = line + 11;

            while (p && *p != '\0' && count < (uint8_t)(sizeof(levels) / sizeof(levels[0])))
            {
                int v = atoi(p);
                char *comma = strchr(p, ',');

                if (v < 0)
                    v = 0;
                if (v > 100)
                    v = 100;
                levels[count++] = (uint8_t)v;

                if (!comma)
                    break;
                p = comma + 1;
            }

            if (count == 0u)
                count = 3u;

            display_show_system_hint("SPK_VOLUME");
            speaker_volume_done_pending = 1u;
            pump_speaker_test_response(1200u);
            (void)i2s_mic_play_volume_steps(levels, count);
        }
        else if (strncmp(line, "MIC_REC:", 8) == 0)
        {
            uint32_t duration_sec = (uint32_t)atoi(line + 8);
            mic_rec_test_start(duration_sec);
        }
    }
}

/* ===================== 音频数据回调 ===================== */

static void on_audio_data(const int16_t *buf, uint16_t len)
{
    uint16_t i;

    if (!buf || len == 0)
        return;

    if (mic_probe_collecting)
    {
        for (i = 0; i < len; i++)
        {
            int16_t s = buf[i];
            if (s != 0 && s != (int16_t)0xFFFF)
            {
                mic_probe_nonzero_count++;
            }
            mic_probe_sample_count++;
        }
    }

