accelerator-s/ai_assistant_stm32/Core/Src/main.c
    if (sys_state != STATE_RECORDING && mic_rec_test_state != MIC_REC_TEST_RUNNING)
        return;

    /* 抽取降采样前先做简单均值滤波（抗混叠）
     * 对每 AUDIO_UPLOAD_DOWNSAMPLE 个样本取平均值，而不是直接丢弃 */
    for (i = 0; i < len; i++)
    {
        int16_t sample;
        uint16_t next;

        audio_upload_downsample_acc += (int32_t)buf[i];
        audio_upload_downsample_count++;
        if (audio_upload_downsample_count < AUDIO_UPLOAD_DOWNSAMPLE)
            continue;

        sample = (int16_t)(audio_upload_downsample_acc / (int32_t)AUDIO_UPLOAD_DOWNSAMPLE);
        sample = audio_upload_apply_gain(sample);
        audio_upload_downsample_acc = 0;
        audio_upload_downsample_count = 0;

        next = (uint16_t)((audio_upload_write_pos + 1u) % AUDIO_UPLOAD_BUFFER_SAMPLES);
        if (next == audio_upload_read_pos)
        {
            audio_upload_overflow = 1u;
            audio_upload_dropped_samples++;
            audio_upload_read_pos = (uint16_t)((audio_upload_read_pos + 1u) % AUDIO_UPLOAD_BUFFER_SAMPLES);
        }
        audio_upload_buffer[audio_upload_write_pos] = sample;
        audio_upload_write_pos = next;
    }
}

/* ===================== 音频异步上传 ===================== */

static void audio_upload_poll(void)
{
    uint16_t available;
    uint16_t read_pos;
    uint16_t write_pos;
    uint16_t contiguous;
    esp8266_send_result_t send_ret;
    uint8_t force_flush_tail;

    if (sys_state != STATE_RECORDING &&
        mic_rec_test_state != MIC_REC_TEST_RUNNING &&
        !rec_end_pending &&
        !mic_rec_done_pending)
        return;

    if (!tcp_ready_for_send())
        return;

    if (esp8266_tx_in_progress())
        return;

    available = audio_buffer_available();
    force_flush_tail = (rec_end_pending || mic_rec_done_pending) ? 1u : 0u;
    if (available < AUDIO_UPLOAD_TRIGGER_SAMPLES && !force_flush_tail)
        return;

    __disable_irq();
    read_pos = audio_upload_read_pos;
    write_pos = audio_upload_write_pos;
    __enable_irq();

    if (write_pos >= read_pos)
    {
        contiguous = (uint16_t)(write_pos - read_pos);
    }
    else
    {
        contiguous = (uint16_t)(AUDIO_UPLOAD_BUFFER_SAMPLES - read_pos);
    }

    if (contiguous > AUDIO_UPLOAD_CHUNK_SAMPLES)
        contiguous = AUDIO_UPLOAD_CHUNK_SAMPLES;

    if (contiguous == 0)
        return;

    send_ret = esp8266_tcp_send_async(
        (const uint8_t *)&audio_upload_buffer[read_pos],
        (uint16_t)(contiguous * sizeof(int16_t)));

    if (send_ret == ESP8266_SEND_OK)
    {
        __disable_irq();
        audio_upload_read_pos = (uint16_t)((audio_upload_read_pos + contiguous) % AUDIO_UPLOAD_BUFFER_SAMPLES);
        __enable_irq();
    }
}

static void try_send_rec_end(void)
{
    esp8266_send_result_t send_ret;
    uint16_t remain;

    if (!rec_end_pending)
        return;

    if (!tcp_ready_for_send())
        return;

    remain = audio_buffer_available();
    if (remain > 0u)
        return;

    if (esp8266_tx_in_progress())
        return;

    send_ret = esp8266_tcp_send_line_async("REC_END");
    if (send_ret == ESP8266_SEND_OK)
    {
        rec_end_pending = 0;
    }
}

static void try_send_speaker_test_ok(void)
{
    esp8266_send_result_t send_ret;

    if (!speaker_test_ok_pending)
        return;

    if (!tcp_ready_for_send())
        return;

    if (esp8266_tx_in_progress())
        return;

    send_ret = esp8266_tcp_send_line_async("SPK_OK");
    if (send_ret == ESP8266_SEND_OK)
    {
        speaker_test_ok_pending = 0u;
        display_show_system_hint("SPK_OK");
        if (sys_state == STATE_IDLE)
        {
            display_update_bottom_hint("K1:录音 K2:发送/新建");
        }
    }
}

static void try_send_speaker_tone_done(void)
{
    esp8266_send_result_t send_ret;

    if (!speaker_tone_done_pending)
        return;

    if (!tcp_ready_for_send())
        return;

    if (esp8266_tx_in_progress())
        return;

    send_ret = esp8266_tcp_send_line_async("SPK_TONE_DONE");
    if (send_ret == ESP8266_SEND_OK)
    {
        speaker_tone_done_pending = 0u;
        display_show_system_hint("SPK_TONE_DONE");
        if (sys_state == STATE_IDLE)
        {
            display_update_bottom_hint("K1:录音 K2:发送/新建");
        }
    }
}

static void try_send_speaker_sweep_done(void)
{
    esp8266_send_result_t send_ret;

    if (!speaker_sweep_done_pending)
        return;

    if (!tcp_ready_for_send())
        return;

    if (esp8266_tx_in_progress())
        return;

    send_ret = esp8266_tcp_send_line_async("SPK_SWEEP_DONE");
    if (send_ret == ESP8266_SEND_OK)
    {
        speaker_sweep_done_pending = 0u;
        display_show_system_hint("SPK_SWEEP_DONE");
        if (sys_state == STATE_IDLE)
        {
            display_update_bottom_hint("K1:录音 K2:发送/新建");
        }
    }
}

static void try_send_speaker_volume_done(void)
{
    esp8266_send_result_t send_ret;

    if (!speaker_volume_done_pending)
        return;

    if (!tcp_ready_for_send())
        return;

    if (esp8266_tx_in_progress())
        return;

    send_ret = esp8266_tcp_send_line_async("SPK_VOLUME_DONE");
    if (send_ret == ESP8266_SEND_OK)
    {
        speaker_volume_done_pending = 0u;
        display_show_system_hint("SPK_VOLUME_DONE");
        if (sys_state == STATE_IDLE)
        {
            display_update_bottom_hint("K1:录音 K2:发送/新建");
        }
    }
}

static void pump_speaker_test_response(uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();

    while ((HAL_GetTick() - start) < timeout_ms)
    {
        try_send_speaker_test_ok();
        try_send_speaker_tone_done();
        try_send_speaker_sweep_done();
        try_send_speaker_volume_done();
        esp8266_poll();

        if (!speaker_test_ok_pending &&
            !speaker_tone_done_pending &&
            !speaker_sweep_done_pending &&
            !speaker_volume_done_pending &&
            !esp8266_tx_in_progress() &&
            esp8266_tx_queue_is_empty())
        {
            break;
        }
    }
}

static void try_send_mic_rec_done(void)
{
    esp8266_send_result_t send_ret;
    uint16_t remain;

    if (!mic_rec_done_pending)
        return;

