accelerator-s/ai_assistant_stm32/Core/Src/main.c
    /* REC_END 和 MIC_REC_DONE 的发送顺序:
     * 如果 rec_end_pending 仍在等待，先等它发完；
     * 如果无 rec_end_pending，等待音频缓冲排干后再发 */
    if (rec_end_pending)
        return;

    /* 等待音频缓冲全部发送完毕 */
    remain = audio_buffer_available();
    if (remain > 0u)
        return;

    if (!tcp_ready_for_send())
        return;

    if (esp8266_tx_in_progress())
        return;

    send_ret = esp8266_tcp_send_line_async("MIC_REC_DONE:sr=8000");
    if (send_ret == ESP8266_SEND_OK)
    {
        mic_rec_done_pending = 0;
        display_show_system_hint("录音测试数据已上传");
        if (sys_state == STATE_IDLE)
        {
            display_update_bottom_hint("K1:录音 K2:发送/新建");
        }
    }
}

/* ===================== 按键事件检测 ===================== */

static key_event_t detect_k2_event(void)
{
    uint8_t pressed = bsp_key_get_k2();
    uint32_t now = HAL_GetTick();

    if (pressed && !k2_was_pressed)
    {
        k2_press_tick = now;
        k2_was_pressed = 1;
    }
    else if (!pressed && k2_was_pressed)
    {
        uint32_t hold_time;
        k2_was_pressed = 0;
        hold_time = now - k2_press_tick;

        if (hold_time >= K2_LONG_PRESS_MS)
        {
            k2_press_count = 0;
            return KEY_EVENT_K2_LONG;
        }

        if ((now - k2_last_release_tick) <= K2_DOUBLE_CLICK_MS)
        {
            k2_press_count = 0;
            k2_last_release_tick = 0;
            return KEY_EVENT_K2_DOUBLE;
        }

        k2_press_count++;
        k2_last_release_tick = now;
    }

    if (k2_press_count > 0 && !pressed &&
        ((now - k2_last_release_tick) > K2_DOUBLE_CLICK_MS))
    {
        k2_press_count = 0;
        return KEY_EVENT_K2_SHORT;
    }

    return KEY_EVENT_NONE;
}

/* ===================== 状态机处理 ===================== */

static void handle_idle(key_event_t k2_ev)
{
    if (!bsp_key_get_k1())
    {
        k1_no_tcp_hint_latched = 0;
    }

    if (bsp_key_get_k1())
    {
        if (!tcp_ready_for_send())
        {
            if (!k1_no_tcp_hint_latched)
            {
                display_show_system_hint("未连接WebUI，无法语音对话");
                display_update_bottom_hint("等待TCP连接...");
                k1_no_tcp_hint_latched = 1;
            }
            return;
        }

        k1_no_tcp_hint_latched = 0;
        sys_state = STATE_RECORDING;
        rec_start_tick = HAL_GetTick();
        rec_end_pending = 0u;
        audio_buffer_reset();
        i2s_mic_start();
        display_start_recording();

        (void)esp8266_tcp_send_line_async("REC_START");
        return;
    }

    if (k2_ev == KEY_EVENT_K2_SHORT)
    {
        display_clear_messages();
        display_update_title("新对话1");
        display_show_system_hint("新会话已开启");
        (void)esp8266_tcp_send_line_async("NEW_SESSION");
        return;
    }

    if (k2_ev == KEY_EVENT_K2_DOUBLE)
    {
        sys_state = STATE_HISTORY;
        (void)esp8266_tcp_send_line_async("GET_HISTORY");
        display_show_history(NULL, 0);
        return;
    }
}

static void handle_recording(void)
{
    uint32_t elapsed = HAL_GetTick() - rec_start_tick;
    display_update_recording(elapsed);

    if (!bsp_key_get_k1())
    {
        i2s_mic_stop();
        sys_state = STATE_REC_PAUSED;
        display_stop_recording();
        display_update_bottom_hint("K1续录 K2短按发送 长按取消");
        return;
    }
}

static void handle_rec_paused(key_event_t k2_ev)
{
    if (bsp_key_get_k1())
    {
        sys_state = STATE_RECORDING;
        i2s_mic_start();
        display_start_recording();
        return;
    }

    if (k2_ev == KEY_EVENT_K2_SHORT)
    {
        uint16_t remain = audio_buffer_available();
        uint32_t flush_start = HAL_GetTick();

        /* 延长刷缓冲时间，确保残余音频数据尽可能发出 */
        while (remain > 0u &&
               tcp_ready_for_send() &&
               (HAL_GetTick() - flush_start) < 500u)
        {
            if (esp8266_tx_in_progress())
            {
                esp8266_poll();
                continue;
            }
            audio_upload_poll();
            remain = audio_buffer_available();
        }

        sys_state = STATE_WAITING;
        display_update_bottom_hint("等待AI回复...");
        display_add_message(
            MSG_ROLE_SYSTEM,
            audio_upload_overflow ? "音频已发送，存在缓冲溢出" : "语音已发送，等待回复...");
        rec_end_pending = 1u;
        try_send_rec_end();
        return;
    }

    if (k2_ev == KEY_EVENT_K2_LONG)
    {
        sys_state = STATE_IDLE;
        audio_buffer_reset();
        rec_end_pending = 0u;
        display_update_bottom_hint("K1:录音 K2:发送/新建");
        display_add_message(MSG_ROLE_SYSTEM, "已取消录音");
        (void)esp8266_tcp_send_line_async("REC_CANCEL");
        return;
    }
}

static void handle_history(key_event_t k2_ev)
{
    if (bsp_key_k1_changed() && bsp_key_get_k1())
    {
        display_history_up();
        return;
    }

    if (k2_ev == KEY_EVENT_K2_SHORT)
    {
        display_history_down();
        return;
    }

    if (k2_ev == KEY_EVENT_K2_DOUBLE)
    {
        uint8_t sel = display_history_get_selected();
        char cmd[32];

        sys_state = STATE_IDLE;
        display_set_state(DISPLAY_STATE_CHAT);

        snprintf(cmd, sizeof(cmd), "LOAD_SESSION:%d", sel);
        (void)esp8266_tcp_send_line_async(cmd);
        return;
    }
}

/* ===================== 系统时钟配置 ===================== */

void SystemClock_Config(void);

/* ===================== 主函数 ===================== */

int main(void)
{
    HAL_Init();
    SystemClock_Config();

    debug_uart_init();
    bsp_key_init();
    display_init();

    i2s_mic_init();
    i2s_mic_set_callback(on_audio_data);

    esp8266_init();

    display_update_wifi("wifi未连接", WIFI_COLOR_DISCONNECTED);
    display_show_system_hint("语音助手已启动");

    esp8266_status_t last_wifi_st = (esp8266_status_t)0xFF;
    char last_ip[20] = {0};
    uint32_t last_tcp_try_tick = 0;
    uint8_t tcp_async_started = 0;
    uint32_t last_hb_tick = 0;
    int last_tcp_conn_state = 0;

#define HEARTBEAT_INTERVAL_MS 15000u

    while (1)
    {
        handle_tcp_downlink();
        esp8266_poll();
        handle_tcp_downlink();
        mic_probe_poll();
        mic_rec_test_poll();

        esp8266_status_t wifi_st = esp8266_get_status();
        if (wifi_st != last_wifi_st)
        {
            switch (wifi_st)
            {
            case ESP8266_STATUS_TCP_CONNECTED:
                display_update_wifi("已连接", WIFI_COLOR_CONNECTED);
                if (sys_state == STATE_IDLE)
                {
                    display_update_bottom_hint("K1:录音 K2:发送/新建");
                }
                break;

            default:
                display_update_wifi("未连接", WIFI_COLOR_DISCONNECTED);
                break;
            }
            last_wifi_st = wifi_st;
        }

        {
            const char *cur_ip = esp8266_get_ip_cached();
            if (cur_ip && cur_ip[0] != '\0' && strcmp(cur_ip, last_ip) != 0)
            {
                strncpy(last_ip, cur_ip, sizeof(last_ip) - 1);
                last_ip[sizeof(last_ip) - 1] = '\0';
            }
        }

        if ((wifi_st == ESP8266_STATUS_WIFI_CONNECTED ||
             wifi_st == ESP8266_STATUS_WIFI_GOT_IP) &&
            (wifi_st == ESP8266_STATUS_WIFI_GOT_IP || last_ip[0] != '\0') &&
            !tcp_async_started &&
            ((HAL_GetTick() - last_tcp_try_tick) > 5000u))
        {
            debug_printf("[TCP] async start %s:%u\r\n", SERVER_IP, (unsigned)SERVER_PORT);
            esp8266_connect_tcp_async(SERVER_IP, SERVER_PORT);
            tcp_async_started = 1;
            last_tcp_try_tick = HAL_GetTick();
            last_tcp_conn_state = 0;
            display_update_wifi("未连接", WIFI_COLOR_DISCONNECTED);
        }

        if (tcp_async_started)
        {
            int tcp_st = esp8266_tcp_connect_state();

            if (tcp_st != last_tcp_conn_state)
            {
                if (tcp_st == 1)
                {
                    display_update_wifi("已连接", WIFI_COLOR_CONNECTED);
                }
                else
                {
                    display_update_wifi("未连接", WIFI_COLOR_DISCONNECTED);
                }
                last_tcp_conn_state = tcp_st;
            }

