accelerator-s/ai_assistant_stm32/Core/Src/main.c
            if (tcp_st == 1)
            {
                debug_printf("[TCP] async connected\r\n");
                tcp_async_started = 0;
            }
            else if (tcp_st == -1)
            {
                debug_printf("[TCP] async failed: %s\r\n", esp8266_get_debug_msg());
                tcp_async_started = 0;
                last_tcp_try_tick = HAL_GetTick();
            }
        }

        if (wifi_st == ESP8266_STATUS_TCP_CONNECTED)
        {
            tcp_async_started = 0;
            last_tcp_conn_state = 1;
        }
        else if (wifi_st == ESP8266_STATUS_WIFI_CONNECTED ||
                 wifi_st == ESP8266_STATUS_WIFI_GOT_IP)
        {
            if (!tcp_async_started)
            {
                last_tcp_conn_state = 0;
            }
        }
        else
        {
            tcp_async_started = 0;
            last_tcp_conn_state = 0;
        }

        if (wifi_st == ESP8266_STATUS_TCP_CONNECTED &&
            ((HAL_GetTick() - last_hb_tick) >= HEARTBEAT_INTERVAL_MS))
        {
            esp8266_tcp_send_heartbeat();
            last_hb_tick = HAL_GetTick();
        }

        bsp_key_update();  /* 更新按键状态 */
        audio_upload_poll();
        try_send_rec_end();
        try_send_speaker_test_ok();
        try_send_speaker_tone_done();
        try_send_speaker_sweep_done();
        try_send_speaker_volume_done();
        try_send_mic_rec_done();

        {
            key_event_t k2_ev = detect_k2_event();

            switch (sys_state)
            {
            case STATE_IDLE:
                handle_idle(k2_ev);
                break;

            case STATE_RECORDING:
                handle_recording();
                break;

            case STATE_REC_PAUSED:
                handle_rec_paused(k2_ev);
                break;

            case STATE_WAITING:
                if (k2_ev == KEY_EVENT_K2_SHORT)
                {
                    sys_state = STATE_IDLE;
                    display_update_bottom_hint("K1:录音 K2:发送/新建");
                }
                break;

            case STATE_HISTORY:
                handle_history(k2_ev);
                break;

            default:
                break;
            }
        }

        bsp_key_k1_changed();
        bsp_key_k2_changed();
    }
}

/* 系统时钟配置: HSE 8MHz -> PLL x9 -> 72MHz */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
    {
        Error_Handler();
    }
}

/* 错误处理: LED 闪烁指示 */
void Error_Handler(void)
{
    GPIO_InitTypeDef err_gpio = {0};
    err_gpio.Pin = GPIO_PIN_12;
    err_gpio.Mode = GPIO_MODE_OUTPUT_PP;
    err_gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &err_gpio);

    while (1)
    {
        HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
        for (volatile uint32_t i = 0; i < 500000; i++)
        {
        }
    }
}

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t *file, uint32_t line)
{
    (void)file;
    (void)line;
}
#endif
